# taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# binaries
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config'

# development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# for react-native
brew 'watchman'
brew 'ruby@2.7'
# TODO: install cocoapods with ruby@2.7.5+

# apps
cask 'authy'
cask 'rectangle'
cask 'linearmouse'
cask 'alt-tab'
cask 'cold-turkey-blocker'
cask 'google-drive'
cask 'sequel-ace'
cask 'bitwarden'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'microsoft-edge'
cask 'postman'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'
