# taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# binaries
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'mas'
brew 'pkg-config'

# development
brew 'node'
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'redis'
brew 'ruby'
brew 'openjdk'
brew 'jq'
brew 'ios-deploy'

# for react-native
brew 'watchman'

# apps
cask 'alt-tab'
cask 'android-studio'
cask 'appcleaner'
cask 'bitwarden'
cask 'cold-turkey-blocker'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'google-chrome',
cask 'google-drive'
cask 'karabiner-elements'
cask 'linearmouse'
cask 'microsoft-edge'
cask 'navicat-for-mysql'
cask 'openinterminal'
cask 'postman'
cask 'qbittorrent'
cask 'raycast'
cask 'rectangle'
cask 'sequel-ace'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp'

# for react-native
cask 'flipper'

# fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'
