# taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# binaries
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'mas'
brew 'pkg-config'

# development
brew 'node'
brew 'php'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'redis'
brew 'ruby'
brew 'openjdk'
brew 'jq'
brew 'ios-deploy'

# for react-native
brew 'watchman'

# utitility system apps
cask 'android-file-transfer' # android file transfer
cask 'alt-tab' # windows-like alt-tab
cask 'appcleaner' # efficient uninstaller
cask 'betterdisplay' # monitor control

# It was just to mute gunbound but it adds a lot of bugs for different things
# cask 'background-music' # volume selector for different apps

# So much shit enable just to invert cmd and ctrl keys
# cask 'karabiner-elements' # keyboard customizer

cask 'linearmouse' # fix mouse acceleration

# Not work
# cask 'notunes' # disable itunes

cask 'maccy' # clipboard manager
cask 'openinterminal' # open terminal from finder
cask 'raycast' # replace spotlight
cask 'rectangle' # window management
cask 'the-unarchiver' # compressed files extractor
cask 'vlc' # video player
cask 'xcodes' # multiple xcode versions

# apps
cask 'android-studio'
cask 'bitwarden'
cask 'cold-turkey-blocker'
cask 'figma'
cask 'firefox'
cask 'google-drive'
cask 'microsoft-edge'
cask 'navicat-for-mysql'
cask 'postman'
cask 'qbittorrent'
cask 'visual-studio-code'
cask 'whatsapp'

# fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'
